<a href="https://colab.research.google.com/github/psiddrtha20027/Data-mining/blob/main/ASSIGMENT_1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [22]:
import pandas as pd
import io
from sklearn.preprocessing import MinMaxScaler, StandardScaler

In [2]:
df = pd.read_csv('/content/_titanic.csv')

In [3]:
print(df)

     PassengerId  Survived  Pclass  \
0              1         0       3
1              2         1       1
2              3         1       3
3              4         1       1
4              5         0       3
..           ...       ...     ...
886          887         0       2
887          888         1       1
888          889         0       3
889          890         1       1
890          891         0       3

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
..                                                 ...     ...   ...    ...
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1
889                              Behr, Mr. Karl Howell    male  26.0      0
890                                Dooley, Mr. Patrick    male  32.0      0

     Parch            Ticket     Fare Cabin Embarked
0        0         A/5 21171   7.2500   NaN        S
1        0          PC 17599  71.2833   C85        C
2        0  STON/O2. 3101282   7.9250   NaN        S
3        0            113803  53.1000  C123        S
4        0            373450   8.0500   NaN        S
..     ...               ...      ...   ...      ...
886      0            211536  13.0000   NaN        S
887      0            112053  30.0000   B42        S
888      2        W./C. 6607  23.4500   NaN        S
889      0            111369  30.0000  C148        C
890      0            370376   7.7500   NaN        Q

[891 rows x 12 columns]

In [4]:
df.isna()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,False,False,False,False,False,False,False,False,False,False,True,False
1,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,True,False
3,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,True,False
...,...,...,...,...,...,...,...,...,...,...,...,...
886,False,False,False,False,False,False,False,False,False,False,True,False
887,False,False,False,False,False,False,False,False,False,False,False,False
888,False,False,False,False,False,True,False,False,False,False,True,False
889,False,False,False,False,False,False,False,False,False,False,False,False
890,False,False,False,False,False,False,False,False,False,False,True,False

In [5]:
df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [6]:
df['Age']

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [7]:
df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [8]:
df['Age']

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [9]:
df['Age'].mean()

29.69911764705882

In [10]:
df['Age'].median()

28.0

In [11]:
df['Age'].mode()

0    24.0
Name: Age, dtype: float64

In [12]:
df['Age'].isna().sum()

177

In [13]:
df['Cabin'].mode()

0        B96 B98
1    C23 C25 C27
2             G6
Name: Cabin, dtype: object

In [14]:
df['Fare'].min()

0.0

In [15]:
df['Fare'].max()

512.3292

In [16]:
df['Fare']=(df['Fare']-df['Fare'].min())//(df['Fare'].max()-df['Fare'].min())

In [17]:
df['Fare']

0      0.0
1      0.0
2      0.0
3      0.0
4      0.0
      ...
886    0.0
887    0.0
888    0.0
889    0.0
890    0.0
Name: Fare, Length: 891, dtype: float64

In [18]:
df['Fare'].unique()

array([0., 1.])

In [19]:
df['Fare'].value_counts()

Fare
0.0    888
1.0      3
Name: count, dtype: int64

In [20]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [26]:
numeric_cols = ['Age', 'Fare', 'Parch', 'SibSp']
df_numeric = df[numeric_cols]

minmax_scaler = MinMaxScaler()
df_minmax = pd.DataFrame(minmax_scaler.fit_transform(df_numeric), columns=df_numeric.columns)
print("Min-Max Normalized Data:\n", df_minmax)

Min-Max Normalized Data:
           Age  Fare     Parch  SibSp
0    0.271174   0.0  0.000000  0.125
1    0.472229   0.0  0.000000  0.125
2    0.321438   0.0  0.000000  0.000
3    0.434531   0.0  0.000000  0.125
4    0.434531   0.0  0.000000  0.000
..        ...   ...       ...    ...
886  0.334004   0.0  0.000000  0.000
887  0.233476   0.0  0.000000  0.000
888       NaN   0.0  0.333333  0.125
889  0.321438   0.0  0.000000  0.000
890  0.396833   0.0  0.000000  0.000

[891 rows x 4 columns]

In [28]:
zscore_scaler = StandardScaler()
df_zscore = pd.DataFrame(zscore_scaler.fit_transform(df_numeric), columns=df_numeric.columns)

print("\nZ-score Standardized Data:\n", df_zscore)

Z-score Standardized Data:
           Age      Fare     Parch     SibSp
0   -0.530377 -0.058124 -0.473674  0.432793
1    0.571831 -0.058124 -0.473674  0.432793
2   -0.254825 -0.058124 -0.473674 -0.474545
3    0.365167 -0.058124 -0.473674  0.432793
4    0.365167 -0.058124 -0.473674 -0.474545
..        ...       ...       ...       ...
886 -0.185937 -0.058124 -0.473674 -0.474545
887 -0.737041 -0.058124 -0.473674 -0.474545
888       NaN -0.058124  2.008933  0.432793
889 -0.254825 -0.058124 -0.473674 -0.474545
890  0.158503 -0.058124 -0.473674 -0.474545

[891 rows x 4 columns]